from tensorflow.keras.preprocessing.text import Tokenizer
from tensorflow.keras.utils import to_categorical # 원-핫 인코딩
############(중요)list는 shape를 찍어볼 수 없다.############ 보고 싶다면 len으로 찍어봐야한다!!!!!!!

text1 = '나는 진짜 매우 맛있는 밥을 진짜 마구 마구 먹었다.'
text2 = '나는 매우 매우 잘생긴 지구용사 태권보이'

token = Tokenizer()
token.fit_on_texts([text1, text2]) # text를 token으로 바꿈
#print(token.word_index)
# {'매우': 1, '나는': 2, '진짜': 3, '마구': 4, '맛있는': 5, '밥을': 6, '먹었다': 7, '잘생긴': 8, '지구용사': 9, '태권보이': 10}

x = token.texts_to_sequences([text1, text2])
#print(x) # [[2, 3, 1, 5, 6, 3, 4, 4, 7], [2, 1, 1, 8, 9, 10]]

x = x[0] + x[1] # # (9,) + (6,) = (15,)
#print(x) # [2, 3, 1, 5, 6, 3, 4, 4, 7, 2, 1, 1, 8, 9, 10]

word_size = len(token.word_index)
#print("word_size: ", word_size) # word_size:  10

x = to_categorical(x)
print(x)
print(x.shape)
'''
[[0. 0. 1. 0. 0. 0. 0. 0. 0. 0. 0.] 나는 
 [0. 0. 0. 1. 0. 0. 0. 0. 0. 0. 0.] 진짜
 [0. 1. 0. 0. 0. 0. 0. 0. 0. 0. 0.] 매우
 [0. 0. 0. 0. 0. 1. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0.]
 [0. 0. 0. 1. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0.]
 [0. 0. 1. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 1. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 1. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0. 1.]]
(15, 11)
'''